In [2]:
import pandas as pd

In [3]:
players = ["Zemy", "Kyle", "Beers", "Holland"]
quads = ["Quad 1", "Quad 2", "Quad 3", "Quad 4"]

In [4]:
df = pd.read_excel("Beerio.xlsx", sheet_name = "Placing")

In [5]:
num_mult = {2 : 0.90,
            3 : 1.0, 
            4 : 1.1}

In [6]:
df2 = df.copy()

In [7]:
# Assuming df is your DataFrame
for i in range(len(df)):
    num_players = 0
    for j, col in enumerate(df.columns):
        # Skip if the value is NaN or the column is 'Match'
        if pd.isna(df.iloc[i, j]) or col == "Match":
            continue
        else:
            num_players += 1
    for j, col in enumerate(df.columns):
        # Skip if the value is NaN or the column is 'Match'
        if pd.isna(df.iloc[i, j]) or col == "Match":
            continue
        else:
            df2.iloc[i, j] = (13 - df.iloc[i, j])*num_mult[num_players]

In [8]:
averages = {}
for player in players:
    averages[player] = df2[player].mean()

In [9]:
averages

{'Zemy': 11.200000000000001,
 'Kyle': 8.916666666666666,
 'Beers': 9.9,
 'Holland': 10.616666666666667}

In [10]:
def quad_game(opp_avg):
    if opp_avg >= 10.5:
        return "Quad 1"
    elif opp_avg >= 9:
        return "Quad 2"
    elif opp_avg >= 8:
        return "Quad 3"
    return "Quad 4"

In [11]:
Quad_data = {"Player" : players,
           "Quad 1" : [0] * len(players),
           "Quad 2" : [0] * len(players),
           "Quad 3" : [0] * len(players),
           "Quad 4" : [0] * len(players) }

Quad_total = pd.DataFrame(Quad_data)
Quad_total = Quad_total.set_index("Player")

Quad_matches = pd.DataFrame(Quad_data)
Quad_matches = Quad_matches.set_index("Player")

Quad = pd.DataFrame(Quad_data)
Quad = Quad.set_index("Player")


for player in players:
    for i in range(len(df2)):
        match_total = 0
        count = 0
        opp_avg = 0
        if pd.isna(df2.loc[i,player]) == True:
            continue
        for opp in players:
            if pd.isna(df2.loc[i,opp]) == False:
                match_total += averages[opp]
                count += 1
        avg = match_total/count
        quad = quad_game(avg)
        Quad_total.loc[player, quad] += df2.loc[i, player]
        Quad_matches.loc[player, quad] += 1
for player in players:
    for quad in quads:
        if Quad_matches.loc[player, quad] == 0:
            continue
        Quad.loc[player, quad] = Quad_total.loc[player, quad]/Quad_matches.loc[player, quad]

In [12]:
Quad_total

         Quad 1  Quad 2  Quad 3  Quad 4
Player
Zemy          0    67.2       0       0
Kyle          0    53.5       0       0
Beers         0     9.9       0       0
Holland       0    63.7       0       0

In [13]:
Quad_matches

         Quad 1  Quad 2  Quad 3  Quad 4
Player
Zemy          0       6       0       0
Kyle          0       6       0       0
Beers         0       1       0       0
Holland       0       6       0       0

In [14]:
Quad

         Quad 1     Quad 2  Quad 3  Quad 4
Player
Zemy          0  11.200000       0       0
Kyle          0   8.916667       0       0
Beers         0   9.900000       0       0
Holland       0  10.616667       0       0